import React from "react";

import payingImage from "../assets/paying.jpeg";
import digitalCashImage from "../assets/digicash.png";
import cashImage from "../assets/cash.jpg";

const HomeMainBG = () => {
	const DRBankLabel = <span className="foreground-primary">DRBank</span>;
	return (
		<main className="theme">
			<h1>Добре дошли в DRBank!</h1>
			<p className="center">Разплащането, опростено.</p>
			<br />
			<div>
				<img src={payingImage} className="para-img left" alt="[Снимка на подаване на банкноти]" />
				<p><em>&emsp;Някога нуждаели ли сте се от средства, но не са Ви били налични под ръка? Чудели ли сте се кой е най-простият начин за обмен на пари? Чували ли сте за онлайн разплащането?</em></p>
				<p>&emsp;{DRBankLabel} е тук, за да помогне на Вас и да Ви насочи към света на онлайн разплащателните системи. С нашия <a href="./" className="link">уеб сайт</a> може да правите преводи, да изготвяте заявки и да разглеждате разходите си. Дизайнът на уеб сайта ни е старателно разработен да бъде интуитивен и удобен за новодошли. Един начинаещ потребител може га разгледа системата и веднага да започне да я използва.</p>
			</div>
			<hr />
			<div>
				<img src={digitalCashImage} className="para-img right" alt="[Снимка на цифрови пари]" />
				<p>&emsp;Днешният свят предполага необходимост за дигитализация на разплащателните процеси. {DRBankLabel} предлага три основни функционалности. Чрез <a href="./transfer" className="link">превод</a> може да изпратите на някой друг потребител средства. <a href="./request" className="link">Заявките</a> са едно от най-гордите постижения – позволяват Ви да заявите пари от други. Последно, възможно е да разгледате Вашата <a href="./stats" className="link">история и статистики</a>.</p>
				<p>&emsp;Винаги най-голям приоритет за нас е удовлетвореността на нашите потребители. Вашият опит ни помага да подобряваме с времето разплащателната ни система. Използвани са съвременни технологии за разработка, което осигурява лесна разшируемост на функционалностите ни.</p>
			</div>
			<hr />
			<div>
				<img src={cashImage} className="para-img left" alt="[Снимка на левове и евро.]" />
				<p>&emsp;Тази система представлява дипломен проект със започната разработка още през октомври месец, 2023 година. От тогава периода на разработване минава през разнообразие от етапи, свързани с всички необходими части на един уеб сайт. {DRBankLabel} е съвкупност от минали проекти и идеи, събрани от обща цел – опростена единна потребителска система за разплащания.</p>
			</div>
			<div className="container width-100 justify">
				<a href="./register" className="btn dark">Регистрирайте се сега!</a>
			</div>
		</main>
	);
};

export default HomeMainBG;